In [64]:
import pandas as pd
import pydataset

## Series

In [29]:
s = pd.Series([1,2,3,5,6,10])

In [30]:
s

0     1
1     2
2     3
3     5
4     6
5    10
dtype: int64

In [31]:
s[2]

3

In [32]:
s[1:3]

1    2
2    3
dtype: int64

In [33]:
s.median()

4.0

In [34]:
s.mean()

4.5

In [35]:
s2 = pd.Series([20,30,40,50])

In [36]:
s.append(s2)

0     1
1     2
2     3
3     5
4     6
5    10
0    20
1    30
2    40
3    50
dtype: int64

## Data Frames

In [52]:
df = pd.DataFrame([
    ["PE", "Pernambuco", "Recife"],
    ["NE", "Nevinha", "Nevorsa"],
    ["SP", "São Paulo", "Nevinha"],
    ["NV", "Nevorsa", "Nevada"],
    ["EV", "NEVA", "nevinha"],
    ["PO", "Portugal", "Nevinhoso"],
    ["OO", "Orientado a nevinha", "Nevinha capital"],
    ["NN", "Nevinha nervosa", "das nevas nevais"],
    ["NN", "Nenhuima nevinha", "Nevinhosa"]
], columns = ["sigla","estado","capital"])

df

  sigla               estado           capital
0    PE           Pernambuco            Recife
1    NE              Nevinha           Nevorsa
2    SP            São Paulo           Nevinha
3    NV              Nevorsa            Nevada
4    EV                 NEVA           nevinha
5    PO             Portugal         Nevinhoso
6    OO  Orientado a nevinha   Nevinha capital
7    NN      Nevinha nervosa  das nevas nevais
8    NN     Nenhuima nevinha         Nevinhosa

In [53]:
df.iloc[:2]

  sigla      estado  capital
0    PE  Pernambuco   Recife
1    NE     Nevinha  Nevorsa

In [54]:
df["sigla"]

0    PE
1    NE
2    SP
3    NV
4    EV
5    PO
6    OO
7    NN
8    NN
Name: sigla, dtype: object

In [56]:
df.index = df["sigla"]

In [57]:
df

      sigla               estado           capital
sigla
PE       PE           Pernambuco            Recife
NE       NE              Nevinha           Nevorsa
SP       SP            São Paulo           Nevinha
NV       NV              Nevorsa            Nevada
EV       EV                 NEVA           nevinha
PO       PO             Portugal         Nevinhoso
OO       OO  Orientado a nevinha   Nevinha capital
NN       NN      Nevinha nervosa  das nevas nevais
NN       NN     Nenhuima nevinha         Nevinhosa

In [60]:
df.ix['PE']

sigla              PE
estado     Pernambuco
capital        Recife
Name: PE, dtype: object

In [61]:
del df['sigla']

In [62]:
df

                    estado           capital
sigla
PE              Pernambuco            Recife
NE                 Nevinha           Nevorsa
SP               São Paulo           Nevinha
NV                 Nevorsa            Nevada
EV                    NEVA           nevinha
PO                Portugal         Nevinhoso
OO     Orientado a nevinha   Nevinha capital
NN         Nevinha nervosa  das nevas nevais
NN        Nenhuima nevinha         Nevinhosa

In [67]:
titanic = pydataset.data('titanic');

In [76]:
titanic.head()

       class     age  sex survived
1  1st class  adults  man      yes
2  1st class  adults  man      yes
3  1st class  adults  man      yes
4  1st class  adults  man      yes
5  1st class  adults  man      yes

In [78]:
titanic.tail()

          class    age    sex survived
1312  3rd class  child  women       no
1313  3rd class  child  women       no
1314  3rd class  child  women       no
1315  3rd class  child  women       no
1316  3rd class  child  women       no

In [79]:
titanic.describe()

            class     age   sex survived
count        1316    1316  1316     1316
unique          3       2     2        2
top     3rd class  adults   man       no
freq          706    1207   869      817

In [85]:
titanic['class'].value_counts()

3rd class    706
1st class    325
2nd class    285
Name: class, dtype: int64